app/controllers/exchanges_controller.rb

SELECT "exchanges".* FROM "exchanges"
---
	def index
    if current_user.try(:admin?)
      @open_exchanges = Exchange.all.select { |e| e.registration_end > DateTime.now }

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT 1  [["id", 12]]
---
	def show
	    @exchange = Exchange.find(params[:id])

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT 1  [["id", 14]]
---
  def edit
    @exchange = Exchange.find(params[:id])

INSERT INTO "exchanges" ("name", "thumburl", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "pwefp'kep"], ["thumburl", ""], ["description", ""], ["created_at", "2015-05-05 23:54:35.161124"], ["updated_at", "2015-05-05 23:54:35.161124"]]
---
  def create
    @exchange = Exchange.new(exchange_params)

    respond_to do |format|
      if @exchange.save

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "exchanges" SET "thumburl" = ?, "updated_at" = ? WHERE "exchanges"."id" = ?  [["thumburl", "http://www.qccrimestoppers.com/images/jewelry.jpg"], ["updated_at", "2015-05-06 00:02:59.720484"], ["id", 14]]
---
  def update
    @exchange = Exchange.find(params[:id])

    respond_to do |format|
      if @exchange.update_attributes(exchange_params)

SELECT  "exchanges".* FROM "exchanges" WHERE "exchanges"."id" = ? LIMIT 1  [["id", 14]]
DELETE FROM "exchanges" WHERE "exchanges"."id" = ?  [["id", 14]]
---
  def destroy
    @exchange = Exchange.find(params[:id])
    @exchange.destroy