app/controllers/pages_controller.rb

SELECT "exchanges".* FROM "exchanges"
---
  def index
  	@exchanges = Exchange.all #s.select { |e| Time.at(e.registration_end) > DateTime.now }